{"format": "keras", "nodes": [{"name": "Generator", "id": "Generator", "class_name": "Functional", "output_shape": [null, 3, 256, 256, 1], "num_parameters": 1955969}, {"name": "Discriminator", "id": "Discriminator", "class_name": "Functional", "output_shape": [null, 1], "num_parameters": 1569025}, {"name": "Discriminator", "id": "Discriminator", "class_name": "Functional", "output_shape": [null, 1], "num_parameters": 1573121}, {"name": "g_loss_frame", "id": "g_loss_frame", "class_name": "Mean", "output_shape": ["multiple"], "num_parameters": 2}, {"name": "g_loss_seq", "id": "g_loss_seq", "class_name": "Mean", "output_shape": ["multiple"], "num_parameters": 2}, {"name": "d_loss_frame", "id": "d_loss_frame", "class_name": "Mean", "output_shape": ["multiple"], "num_parameters": 2}, {"name": "d_loss_seq", "id": "d_loss_seq", "class_name": "Mean", "output_shape": ["multiple"], "num_parameters": 2}, {"name": "d_acc_frame", "id": "d_acc_frame", "class_name": "BinaryAccuracy", "output_shape": ["multiple"], "num_parameters": 2}, {"name": "d_acc_seq", "id": "d_acc_seq", "class_name": "BinaryAccuracy", "output_shape": ["multiple"], "num_parameters": 2}, {"name": "rec_loss", "id": "rec_loss", "class_name": "Mean", "output_shape": ["multiple"], "num_parameters": 2}], "edges": []}